In [1]:
import pandas as pd
import numpy as np
import datetime

In [2]:
date1='20170101'
date2=datetime.datetime(2016,10,1,15,0)

In [3]:
t1=pd.Timestamp(date1)

In [4]:
t1,type(t1)

(Timestamp('2017-01-01 00:00:00'), pandas._libs.tslibs.timestamps.Timestamp)

In [5]:
ta=pd.to_datetime(date1)

In [6]:
ta,type(ta)

(Timestamp('2017-01-01 00:00:00'), pandas._libs.tslibs.timestamps.Timestamp)

In [7]:
date1='20170101 23:00:01'
date2=datetime.datetime(2016,10,1,15,0)

t1=pd.Timestamp(date1)
t2=pd.Timestamp(date2)

In [8]:
lst_date=['2017-10-1','2018-9-12','2013,10,2']
t3=pd.to_datetime(lst_date)

In [9]:
t3

DatetimeIndex(['2017-10-01', '2018-09-12', '2013-02-01'], dtype='datetime64[ns]', freq=None)

In [10]:
time_range=pd.DatetimeIndex(['2010-10-1','2010-10-3','2010-10-5'])

In [11]:
time_range

DatetimeIndex(['2010-10-01', '2010-10-03', '2010-10-05'], dtype='datetime64[ns]', freq=None)

In [12]:
time_range=pd.to_datetime(['2010-10-1','2010-10-3','2010-10-5'])

In [13]:
time_range

DatetimeIndex(['2010-10-01', '2010-10-03', '2010-10-05'], dtype='datetime64[ns]', freq=None)

In [14]:
data=pd.Series(np.random.randn(3),index=time_range)

In [15]:
data

2010-10-01   -2.046489
2010-10-03   -1.073163
2010-10-05   -1.056560
dtype: float64

In [16]:
rng1=pd.date_range('2017-10-3','2017-10-5',normalize=True)

In [17]:
rng1

DatetimeIndex(['2017-10-03', '2017-10-04', '2017-10-05'], dtype='datetime64[ns]', freq='D')

In [18]:
rng2=pd.date_range('2017-10-3',periods=10,normalize=True)

In [19]:
rng2

DatetimeIndex(['2017-10-03', '2017-10-04', '2017-10-05', '2017-10-06',
               '2017-10-07', '2017-10-08', '2017-10-09', '2017-10-10',
               '2017-10-11', '2017-10-12'],
              dtype='datetime64[ns]', freq='D')

In [20]:
rng3=pd.bdate_range(end='2017-10-3',periods=10,normalize=True,closed='right')

In [21]:
rng3

DatetimeIndex(['2017-09-20', '2017-09-21', '2017-09-22', '2017-09-25',
               '2017-09-26', '2017-09-27', '2017-09-28', '2017-09-29',
               '2017-10-02', '2017-10-03'],
              dtype='datetime64[ns]', freq='B')

In [22]:
rng4=pd.bdate_range(end='2017-10-3',periods=10,normalize=True,closed='right')

In [23]:
rng4

DatetimeIndex(['2017-09-20', '2017-09-21', '2017-09-22', '2017-09-25',
               '2017-09-26', '2017-09-27', '2017-09-28', '2017-09-29',
               '2017-10-02', '2017-10-03'],
              dtype='datetime64[ns]', freq='B')

In [24]:
rng5=pd.date_range('2017-10-3',periods=10,normalize=True,freq='H',closed='right')

In [25]:
rng5

DatetimeIndex(['2017-10-03 01:00:00', '2017-10-03 02:00:00',
               '2017-10-03 03:00:00', '2017-10-03 04:00:00',
               '2017-10-03 05:00:00', '2017-10-03 06:00:00',
               '2017-10-03 07:00:00', '2017-10-03 08:00:00',
               '2017-10-03 09:00:00'],
              dtype='datetime64[ns]', freq='H')

In [26]:
rng6=pd.date_range('2017-10-3',periods=10,normalize=True,freq='WOM-2THU',closed='right')

In [27]:
rng6

DatetimeIndex(['2017-10-12', '2017-11-09', '2017-12-14', '2018-01-11',
               '2018-02-08', '2018-03-08', '2018-04-12', '2018-05-10',
               '2018-06-14', '2018-07-12'],
              dtype='datetime64[ns]', freq='WOM-2THU')

In [28]:
ts=pd.Series(np.random.randn(4),index=pd.date_range('2017-10-3',periods=4,closed='left'))

In [29]:
ts

2017-10-03    0.176221
2017-10-04    1.506619
2017-10-05   -0.577995
2017-10-06   -0.484555
Freq: D, dtype: float64

In [30]:
ts1=ts.asfreq('S',method='ffill')

In [31]:
ts1

2017-10-03 00:00:00    0.176221
2017-10-03 00:00:01    0.176221
2017-10-03 00:00:02    0.176221
2017-10-03 00:00:03    0.176221
2017-10-03 00:00:04    0.176221
                         ...
2017-10-05 23:59:56   -0.577995
2017-10-05 23:59:57   -0.577995
2017-10-05 23:59:58   -0.577995
2017-10-05 23:59:59   -0.577995
2017-10-06 00:00:00   -0.484555
Freq: S, Length: 259201, dtype: float64

In [32]:
ts2=ts1.shift(2)

In [33]:
ts2

2017-10-03 00:00:00         NaN
2017-10-03 00:00:01         NaN
2017-10-03 00:00:02    0.176221
2017-10-03 00:00:03    0.176221
2017-10-03 00:00:04    0.176221
                         ...
2017-10-05 23:59:56   -0.577995
2017-10-05 23:59:57   -0.577995
2017-10-05 23:59:58   -0.577995
2017-10-05 23:59:59   -0.577995
2017-10-06 00:00:00   -0.577995
Freq: S, Length: 259201, dtype: float64

In [34]:
date1=pd.Series(np.random.rand(5),index=pd.date_range('2017-1-1',freq='d',periods=5))

In [35]:
date1

2017-01-01    0.494842
2017-01-02    0.715194
2017-01-03    0.373797
2017-01-04    0.336650
2017-01-05    0.492123
Freq: D, dtype: float64

In [36]:
date2=pd.Series(np.random.rand(5),index=pd.date_range('2017-1-1',freq='3M',periods=5))

In [37]:
date2

2017-01-31    0.745579
2017-04-30    0.704911
2017-07-31    0.551195
2017-10-31    0.242885
2018-01-31    0.796930
Freq: 3M, dtype: float64

In [38]:
date3=pd.DataFrame(np.random.rand(16).reshape(4,4),index=pd.date_range('2017-12-1',freq='10T',periods=4),columns=['value1','value2','value3','value4'])

In [39]:
date3

                       value1    value2    value3    value4
2017-12-01 00:00:00  0.415804  0.410420  0.631855  0.736040
2017-12-01 00:10:00  0.771442  0.331627  0.379387  0.676695
2017-12-01 00:20:00  0.855947  0.552442  0.181452  0.333362
2017-12-01 00:30:00  0.885986  0.364700  0.350485  0.723647

In [40]:
date4=date3.asfreq('5T',method='ffill')

In [41]:
date4

                       value1    value2    value3    value4
2017-12-01 00:00:00  0.415804  0.410420  0.631855  0.736040
2017-12-01 00:05:00  0.415804  0.410420  0.631855  0.736040
2017-12-01 00:10:00  0.771442  0.331627  0.379387  0.676695
2017-12-01 00:15:00  0.771442  0.331627  0.379387  0.676695
2017-12-01 00:20:00  0.855947  0.552442  0.181452  0.333362
2017-12-01 00:25:00  0.855947  0.552442  0.181452  0.333362
2017-12-01 00:30:00  0.885986  0.364700  0.350485  0.723647

In [42]:
df=pd.DataFrame(np.random.rand(12).reshape(3,4),index=['one','two','three'],columns=['A','B','C','D'])

In [43]:
df

              A         B         C         D
one    0.175047  0.337795  0.987092  0.220237
two    0.098774  0.795034  0.081452  0.311028
three  0.267530  0.110837  0.479558  0.623019

In [44]:
df.loc['one']

A    0.175047
B    0.337795
C    0.987092
D    0.220237
Name: one, dtype: float64

In [45]:
df[['A']][0:2]

            A
one  0.175047
two  0.098774

In [46]:
df.loc[['one','two'],['A']]

            A
one  0.175047
two  0.098774

In [47]:
df.iloc[1:3]

              A         B         C         D
two    0.098774  0.795034  0.081452  0.311028
three  0.267530  0.110837  0.479558  0.623019

In [48]:
p=pd.Period('2017',freq='M')

In [49]:
p

Period('2017-01', 'M')

In [50]:
r=pd.period_range('2017','2020',freq='M')

In [51]:
r

PeriodIndex(['2017-01', '2017-02', '2017-03', '2017-04', '2017-05', '2017-06',
             '2017-07', '2017-08', '2017-09', '2017-10', '2017-11', '2017-12',
             '2018-01', '2018-02', '2018-03', '2018-04', '2018-05', '2018-06',
             '2018-07', '2018-08', '2018-09', '2018-10', '2018-11', '2018-12',
             '2019-01', '2019-02', '2019-03', '2019-04', '2019-05', '2019-06',
             '2019-07', '2019-08', '2019-09', '2019-10', '2019-11', '2019-12',
             '2020-01'],
            dtype='period[M]', freq='M')

In [52]:
p=pd.Period('2017',freq='A-DEC')

In [53]:
p

Period('2017', 'A-DEC')

In [54]:
q=p.asfreq('M',how='end')

In [55]:
q

Period('2017-12', 'M')

In [56]:
a=['2010-1-1','2010-3-3','2013-5-12']
data=pd.DatetimeIndex(a)

In [57]:
data_range=pd.date_range(2010-1-1,2010-3-3,freq='M')
date_period=pd.period_range(2010-1-1,2010-3-3,freq='M')

In [58]:
data_range,date_period

(DatetimeIndex([], dtype='datetime64[ns]', freq='M'),
 PeriodIndex([], dtype='period[M]', freq='M'))

In [59]:
p=pd.Period('2017',freq='A-DEC')

In [60]:
p

Period('2017', 'A-DEC')

In [61]:
q=p.asfreq('M',how='start')

In [62]:
q

Period('2017-01', 'M')

In [63]:
q1=p.asfreq('M',how='end')

In [64]:
q1

Period('2017-12', 'M')

In [65]:
q2=p.to_timestamp()

In [66]:
q2

Timestamp('2017-01-01 00:00:00')

In [67]:
range=pd.date_range('2017-1-1',periods=12,freq='D')

In [68]:
range

DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
               '2017-01-05', '2017-01-06', '2017-01-07', '2017-01-08',
               '2017-01-09', '2017-01-10', '2017-01-11', '2017-01-12'],
              dtype='datetime64[ns]', freq='D')

In [69]:
ts=pd.Series(np.arange(len(range)),index=range)

In [70]:
ts_re=ts.resample('3D')

In [71]:
ts_re

In [72]:
rng=pd.date_range('2017/1','2017/3',freq='D')
ts=pd.Series(np.random.rand(len(rng)),index=rng)

In [73]:
ts

2017-01-01    0.735336
2017-01-02    0.618295
2017-01-03    0.609015
2017-01-04    0.833524
2017-01-05    0.666789
2017-01-06    0.042277
2017-01-07    0.409087
2017-01-08    0.175655
2017-01-09    0.186828
2017-01-10    0.502112
2017-01-11    0.208203
2017-01-12    0.648253
2017-01-13    0.777261
2017-01-14    0.110985
2017-01-15    0.501434
2017-01-16    0.274165
2017-01-17    0.300123
2017-01-18    0.087215
2017-01-19    0.808468
2017-01-20    0.729647
2017-01-21    0.193367
2017-01-22    0.613915
2017-01-23    0.092428
2017-01-24    0.471944
2017-01-25    0.483199
2017-01-26    0.091864
2017-01-27    0.475064
2017-01-28    0.323686
2017-01-29    0.285717
2017-01-30    0.446731
2017-01-31    0.492302
2017-02-01    0.985027
2017-02-02    0.012049
2017-02-03    0.370942
2017-02-04    0.396648
2017-02-05    0.842634
2017-02-06    0.038177
2017-02-07    0.133655
2017-02-08    0.040827
2017-02-09    0.042853
2017-02-10    0.432068
2017-02-11    0.681235
2017-02-12    0.738837
2017-02-13    0.125803
2017-02-14    0.325200
2017-02-15    0.883368
2017-02-16    0.983466
2017-02-17    0.245896
2017-02-18    0.199525
2017-02-19    0.812562
2017-02-20    0.540831
2017-02-21    0.142497
2017-02-22    0.632966
2017-02-23    0.269658
2017-02-24    0.090613
2017-02-25    0.814202
2017-02-26    0.600779
2017-02-27    0.144914
2017-02-28    0.060190
2017-03-01    0.912835
Freq: D, dtype: float64

In [74]:
ts.loc['2017-02-28']

0.06019037709509745

In [75]:
ts[datetime(2017,2,28)]

TypeError: 'module' object is not callable

In [76]:
ts.loc['2017-02-11':'2017-02-28']

2017-02-11    0.681235
2017-02-12    0.738837
2017-02-13    0.125803
2017-02-14    0.325200
2017-02-15    0.883368
2017-02-16    0.983466
2017-02-17    0.245896
2017-02-18    0.199525
2017-02-19    0.812562
2017-02-20    0.540831
2017-02-21    0.142497
2017-02-22    0.632966
2017-02-23    0.269658
2017-02-24    0.090613
2017-02-25    0.814202
2017-02-26    0.600779
2017-02-27    0.144914
2017-02-28    0.060190
Freq: D, dtype: float64

In [77]:
ts.is_unique

True

In [78]:
ts.loc['2017-02'] #月索引

2017-02-01    0.985027
2017-02-02    0.012049
2017-02-03    0.370942
2017-02-04    0.396648
2017-02-05    0.842634
2017-02-06    0.038177
2017-02-07    0.133655
2017-02-08    0.040827
2017-02-09    0.042853
2017-02-10    0.432068
2017-02-11    0.681235
2017-02-12    0.738837
2017-02-13    0.125803
2017-02-14    0.325200
2017-02-15    0.883368
2017-02-16    0.983466
2017-02-17    0.245896
2017-02-18    0.199525
2017-02-19    0.812562
2017-02-20    0.540831
2017-02-21    0.142497
2017-02-22    0.632966
2017-02-23    0.269658
2017-02-24    0.090613
2017-02-25    0.814202
2017-02-26    0.600779
2017-02-27    0.144914
2017-02-28    0.060190
Freq: D, dtype: float64

In [79]:
ts_re=ts.resample('3D')

In [80]:
ts_re.sum()

2017-01-01    1.962646
2017-01-04    1.542589
2017-01-07    0.771570
2017-01-10    1.358567
2017-01-13    1.389680
2017-01-16    0.661503
2017-01-19    1.731482
2017-01-22    1.178287
2017-01-25    1.050126
2017-01-28    1.056134
2017-01-31    1.489379
2017-02-03    1.610223
2017-02-06    0.212659
2017-02-09    1.156156
2017-02-12    1.189840
2017-02-15    2.112731
2017-02-18    1.552918
2017-02-21    1.045121
2017-02-24    1.505595
2017-02-27    1.117939
Freq: 3D, dtype: float64

In [81]:
range=pd.date_range('2017-1-1',periods=12)
ts=pd.Series(np.arange(len(range)),index=range)
ts_re=ts.resample('3D').std()

In [82]:
ts_re

2017-01-01    1.0
2017-01-04    1.0
2017-01-07    1.0
2017-01-10    1.0
Freq: 3D, dtype: float64

In [83]:
ts_re3=ts.resample('5D').asfreq()

In [84]:
ts_re3

2017-01-01     0
2017-01-06     5
2017-01-11    10
Freq: 5D, dtype: int64

In [85]:
ts_re3=ts.resample('H').asfreq().ffill()

In [86]:
ts_re3

2017-01-01 00:00:00     0.0
2017-01-01 01:00:00     0.0
2017-01-01 02:00:00     0.0
2017-01-01 03:00:00     0.0
2017-01-01 04:00:00     0.0
                       ...
2017-01-11 20:00:00    10.0
2017-01-11 21:00:00    10.0
2017-01-11 22:00:00    10.0
2017-01-11 23:00:00    10.0
2017-01-12 00:00:00    11.0
Freq: H, Length: 265, dtype: float64

In [87]:
df=pd.DataFrame(
    {'key1':[4,5,3,np.nan,2],
     'key2':[1,2,np.nan,4,5],
     'key3':[1,2,3,'j','k']
    },
    index=['a','b','c','d','e'])

In [88]:
df

   key1  key2 key3
a   4.0   1.0    1
b   5.0   2.0    2
c   3.0   NaN    3
d   NaN   4.0    j
e   2.0   5.0    k

In [89]:
df.mean()

key1    3.5
key2    3.0
dtype: float64

In [90]:
df.mean(axis=1,skipna=False)

a    2.5
b    3.5
c    NaN
d    NaN
e    3.5
dtype: float64

In [91]:
df.quantile(q=0.75)

key1    4.25
key2    4.25
Name: 0.75, dtype: float64

In [92]:
df['key1_s']=df['key1'].cumsum()
df['key2_s']=df['key2'].cumprod()

In [93]:
df.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [94]:
df['key1'].cummax()

a    4.0
b    5.0
c    5.0
d    NaN
e    5.0
Name: key1, dtype: float64

In [95]:
s=pd.Series(list('aabbccddeeff'))
sq=s.unique()

In [96]:
sq

array(['a', 'b', 'c', 'd', 'e', 'f'], dtype=object)

In [97]:
sqs=pd.Series(sq)

In [98]:
sqs.sorted(0)

AttributeError: 'Series' object has no attribute 'sorted'

In [99]:
print(sq.sort())

None

In [100]:
sqs.sort()

AttributeError: 'Series' object has no attribute 'sort'

In [101]:
s=pd.Series(np.arange(10,15))
df=pd.DataFrame({'key1':list('asdcbvasd'),'key2':np.arange(4,13)})

In [102]:
print(s.isin([5,14]))

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [103]:
print(df.isin([5,14]))

    key1   key2
0  False  False
1  False   True
2  False  False
3  False  False
4  False  False
5  False  False
6  False  False
7  False  False
8  False  False

In [104]:
data=pd.DataFrame(np.random.randn(10).reshape(5,2)*100,columns=['key1','key2'])

In [105]:
data

         key1        key2
0   77.550309  105.387077
1  -87.719365   43.165590
2  157.603118  219.152697
3  -10.079334  -47.553684
4   88.382074 -143.360224

In [106]:
data['key1'].mean()

45.14736054118087

In [107]:
data['key2'].cummax()

0    105.387077
1    105.387077
2    219.152697
3    219.152697
4    219.152697
Name: key2, dtype: float64

In [108]:
data['key1'].median()

77.55030910018472

In [109]:
data['key1_s']=data['key1'].cumsum()
data['key2_s']=data['key2'].cumprod()

In [110]:
data

         key1        key2      key1_s        key2_s
0   77.550309  105.387077   77.550309  1.053871e+02
1  -87.719365   43.165590  -10.169056  4.549095e+03
2  157.603118  219.152697  147.434063  9.969465e+05
3  -10.079334  -47.553684  137.354729 -4.740848e+07
4   88.382074 -143.360224  225.736803  6.796490e+09

1,2,3,4,5,4

TypeError: 'bool' object is not callable

In [125]:
def judge(x):
    x=list(x)
    x_series=pd.Series(x)
    print(type(x_series.unique())

x=input()
judge(x)

SyntaxError: invalid syntax (<ipython-input-125-59f3f50fd835>, line 6)

In [128]:

def judge(x):
    x=list(x.split(','))
    x_series=pd.Series(x)
    print(x_series.unique())

x=input()
judge(x)

1,2,3,4
['1' ',' '2' '3' '4']

In [130]:
s=pd.Series(['A','B','C',123,np.nan,'ai'])

s.str.count('B') #统计b的数目

0    0.0
1    1.0
2    0.0
3    NaN
4    NaN
5    0.0
dtype: float64

In [131]:
s.count('B')

KeyError: 'Requested level (B) does not match index name (None)'

In [132]:
s.str.upper()

0      A
1      B
2      C
3    NaN
4    NaN
5     AI
dtype: object

In [134]:
s=pd.Series(['a,b,c','1,2,3',['a,,,c'],np.nan])

In [135]:
s

0      a,b,c
1      1,2,3
2    [a,,,c]
3        NaN
dtype: object

In [137]:
s.str.split(',')[1]

['1', '2', '3']

In [139]:
s.str.split(',')[0]

['a', 'b', 'c']

In [143]:
s.str.split(',').str[0]

0      a
1      1
2    NaN
3    NaN
dtype: object

In [144]:
s.str.split(',',expand=True)

     0    1    2
0    a    b    c
1    1    2    3
2  NaN  NaN  NaN
3  NaN  NaN  NaN

In [146]:
data1=pd.DataFrame({'key':['a','b','c'],'values1':np.random.randn(3)})

In [151]:
data2=pd.DataFrame({'key':['b','c','d'],'values2':np.random.randn(3)})

In [152]:
data1,data2

(  key   values1
 0   a  0.657176
 1   b -0.517577
 2   c  1.413000,
   key   values2
 0   b -1.118658
 1   c  0.644426
 2   d  0.658089)

In [155]:
data3=pd.merge(data1,data2,how='outer')

In [156]:
data3

  key   values1   values2
0   a  0.657176       NaN
1   b -0.517577 -1.118658
2   c  1.413000  0.644426
3   d       NaN  0.658089

In [157]:
s=pd.Series([1,1,2,3,4,5,6,7,8,4,5,6,7])

In [158]:
s.duplicated()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10     True
11     True
12     True
dtype: bool

In [159]:
s1=s.drop_duplicates()

In [160]:
s1

0    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
dtype: int64

In [161]:
df=pd.DataFrame({'X':['A','B','C','D'],'Y':[1,4,3,2]})

In [166]:
df

   X  Y
0  A  1
1  B  4
2  C  3
3  D  2

In [164]:
list(df.groupby('X'))[0]

('A',
    X  Y
 0  A  1)

In [171]:
for m in df.groupby('X'):
   print(m)

('A',    X  Y
0  A  1)
('B',    X  Y
1  B  4)
('C',    X  Y
2  C  3)
('D',    X  Y
3  D  2)

In [168]:
df.groupby('X').groups

{'A': Int64Index([0], dtype='int64'),
 'B': Int64Index([1], dtype='int64'),
 'C': Int64Index([2], dtype='int64'),
 'D': Int64Index([3], dtype='int64')}

In [174]:
df=pd.DataFrame({
    'A':['one','two','three','one','two','three','one','two'],
    'B':list('hhhhffff'),
    'C':[10,12,14,16,18,20,22,24],
    'D':np.random.randn(8),
    'E':np.random.randn(8)})

In [175]:
df

       A  B   C         D         E
0    one  h  10 -0.640802  1.588928
1    two  h  12 -0.657195  0.839690
2  three  h  14 -0.872640 -0.204595
3    one  h  16  0.299186  1.090392
4    two  f  18 -0.981929  0.081469
5  three  f  20 -0.267071  0.768533
6    one  f  22  1.830400 -1.397594
7    two  f  24  0.248462 -0.249183

In [176]:
A1=df.groupby('A')[['C','D']].mean()

In [177]:
A1

        C         D
A
one    16  0.496262
three  17 -0.569855
two    18 -0.463554

In [178]:
A2=df.groupby(['A','B'])[['C','D']].sum()

In [179]:
A2

          C         D
A     B
one   f  22  1.830400
      h  26 -0.341615
three f  20 -0.267071
      h  14 -0.872640
two   f  42 -0.733467
      h  12 -0.657195

In [194]:
A3=df.groupby('A').groups

In [195]:
A3

{'one': Int64Index([0, 3, 6], dtype='int64'),
 'three': Int64Index([2, 5], dtype='int64'),
 'two': Int64Index([1, 4, 7], dtype='int64')}

In [223]:
A4=list(df.groupby('A'))[0]

In [224]:
A4

('one',
      A  B   C         D         E
 0  one  h  10 -0.640802  1.588928
 3  one  h  16  0.299186  1.090392
 6  one  f  22  1.830400 -1.397594)

In [219]:
A4=df.groupby('A').get_group('one')

In [220]:
A4

     A  B   C         D         E
0  one  h  10 -0.640802  1.588928
3  one  h  16  0.299186  1.090392
6  one  f  22  1.830400 -1.397594

In [198]:
A4

('one',
      A  B   C         D         E
 0  one  h  10 -0.640802  1.588928
 3  one  h  16  0.299186  1.090392
 6  one  f  22  1.830400 -1.397594)

In [214]:
A5=df.groupby(df.dtypes,axis=1)

In [215]:
for m,n in A5:
    print(m)
    print(n)

int64
    C
0  10
1  12
2  14
3  16
4  18
5  20
6  22
7  24
float64
          D         E
0 -0.640802  1.588928
1 -0.657195  0.839690
2 -0.872640 -0.204595
3  0.299186  1.090392
4 -0.981929  0.081469
5 -0.267071  0.768533
6  1.830400 -1.397594
7  0.248462 -0.249183
object
       A  B
0    one  h
1    two  h
2  three  h
3    one  h
4    two  f
5  three  f
6    one  f
7    two  f

In [217]:
A7=df.groupby('B').agg([np.mean,np.sum,np.max,np.min])

In [218]:
A7

     C                       D                                       E  \
  mean sum amax amin      mean       sum      amax      amin      mean
B
f   21  84   24   18  0.207465  0.829862  1.830400 -0.981929 -0.199194
h   13  52   16   10 -0.467863 -1.871450  0.299186 -0.872640  0.828604


        sum      amax      amin
B
f -0.796776  0.768533 -1.397594
h  3.314415  1.588928 -0.204595

In [ ]:
m=df.groupby('A').get_group('one')

In [229]:
date=['2017-5-1','2017-5-2','2017-5-3']*3
rng=pd.to_datetime(date)
df=pd.DataFrame({'date':rng,'key':list('abcdabcda'),'values':np.random.rand(9)*10})

In [230]:
df

        date key    values
0 2017-05-01   a  1.687991
1 2017-05-02   b  0.033270
2 2017-05-03   c  9.635432
3 2017-05-01   d  6.804615
4 2017-05-02   a  1.738373
5 2017-05-03   b  8.651797
6 2017-05-01   c  5.745737
7 2017-05-02   d  6.750599
8 2017-05-03   a  2.485495

In [233]:
pd.pivot_table(index=['date','key'],columns='key',values='values',data=df,aggfunc=np.mean)

key                    a         b         c         d
date       key
2017-05-01 a    1.687991       NaN       NaN       NaN
           c         NaN       NaN  5.745737       NaN
           d         NaN       NaN       NaN  6.804615
2017-05-02 a    1.738373       NaN       NaN       NaN
           b         NaN  0.033270       NaN       NaN
           d         NaN       NaN       NaN  6.750599
2017-05-03 a    2.485495       NaN       NaN       NaN
           b         NaN  8.651797       NaN       NaN
           c         NaN       NaN  9.635432       NaN

In [234]:
df1=pd.DataFrame({'A':[1,2,2,2,2],'B':[3,3,4,4,4],'C':[1,1,np.nan,1,1]})
df1

   A  B    C
0  1  3  1.0
1  2  3  1.0
2  2  4  NaN
3  2  4  1.0
4  2  4  1.0

In [236]:
pd.crosstab(df1['A'],df1['B'])

B  3  4
A
1  1  0
2  1  3